000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. IS_PRIME.
000003 DATA DIVISION.
000004 LINKAGE SECTION.
000005 01 RESULT-FLAG  PIC X.
000006 PROCEDURE DIVISION.
000007     MOVE 'N' TO RESULT-FLAG
000008     STOP RUN.